Catalogs/Renault_НастрокиПланаПродажАвтосервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_НастрокиПланаПродажАвтосервиса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоВидамПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПланирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ВидыПланированияПланаПродажАвтосервиса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурсПланирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРесурса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРесурса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоБонусамМалусам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПланирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ВидыПланированияПланаПродажАвтосервиса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБонуса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Renault_ВидыБонусовМалусовПланаПродажАвтосервиса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляВидаБонуса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидМалуса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Renault_ВидыБонусовМалусовПланаПродажАвтосервиса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляВидаМалуса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Автоработы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Автоработы</Name>
			<Comment>Автоработы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидНормировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_СложностьРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_СложностьРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОкраска</Name>
					<Comment>Это окраска</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеПредложение</Name>
					<Comment>Признак того что эта авторабота является дополнительным предложением</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьДанныеВЗаявкеНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нормочас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПакетДляКомплектации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормыРасходаМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_НастрокиПланаПродажАвтосервиса/Forms/ФормаЭлемента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////События формы///////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветФонаСтандартный = Новый Цвет(255, 255, 255);
	ЦветФонаСтрокиСДанными = Новый Цвет(64, 244, 208);
	ЦветФонаСтрокиСОшибками = Новый Цвет(255, 136, 108);
	
	Запрос = Новый Запрос;
	
	СсылкаНаОбъект = Объект.Ссылка;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ВидыПланированияПланаПродажАвтосервиса.Ссылка КАК ВидПланирования
		|ИЗ
		|	Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса КАК Renault_ВидыПланированияПланаПродажАвтосервиса
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоБонусамМалусам КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам
		|		ПО (Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.ВидПланирования = Renault_ВидыПланированияПланаПродажАвтосервиса.Ссылка)
		|			И (Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.Ссылка = &Ссылка)
		|ГДЕ
		|	НЕ Renault_ВидыПланированияПланаПродажАвтосервиса.ПометкаУдаления
		|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.ВидПланирования ЕСТЬ NULL "; 
		
		//Для оформления табличной части ДанныеПоБонусамМалусам
		ЗапросДляОформления = Новый Запрос;
		ЗапросДляОформления.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования
			|ИЗ
			|	Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоВидамПланирования КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования
			|ГДЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.Ссылка = &Ссылка";		
		ЗапросДляОформления.УстановитьПараметр("Ссылка", СсылкаНаОбъект);	
		РезультатЗапросаДляОформления = ЗапросДляОформления.Выполнить();
		
		Выборка = РезультатЗапросаДляОформления.Выбрать();
		
		СписокВидовПланирования = Новый СписокЗначений();
		
		Пока Выборка.Следующий() Цикл
			СписокВидовПланирования.Добавить(Выборка.ВидПланирования);
		КонецЦикла;
		
		Оформление(ЦветФонаСтрокиСДанными, СписокВидовПланирования);
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ВидыПланированияПланаПродажАвтосервиса.Ссылка КАК ВидПланирования
		|ИЗ
		|	Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса КАК Renault_ВидыПланированияПланаПродажАвтосервиса
		|ГДЕ
		|	НЕ Renault_ВидыПланированияПланаПродажАвтосервиса.ПометкаУдаления";
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		ТабВидыПланирования = Объект.ДанныеПоБонусамМалусам;
		
		Пока Выборка.Следующий() Цикл
			Стр = ТабВидыПланирования.Добавить();
			Стр.ВидПланирования = Выборка.ВидПланирования;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Автор) Тогда
		Элементы.Автор.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийВидПланирования) Тогда
		Если ДанныеПоВидамПланированияБуфер.Количество() <> 0 Тогда
			ПерезаполнитьДанныеПоВидамПланированияИзБуфера();
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Утвержден Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования
			|ПОМЕСТИТЬ ТаблицаНезаполненныхДанных
			|ИЗ
			|	Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоВидамПланирования КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования
			|ГДЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования В (ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовара), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхАвторабот), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовараИзПапки), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовара), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданныхАвторабот), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовараИзПапки))
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.РесурсПланирования = НЕОПРЕДЕЛЕНО
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования
			|ИЗ
			|	Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоВидамПланирования КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования
			|ГДЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования В (ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхАвторабот), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданныхАвторабот))
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.РесурсПланирования = ЗНАЧЕНИЕ(Справочник.Автоработы.ПустаяСсылка)
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования
			|ИЗ
			|	Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоВидамПланирования КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования
			|ГДЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования В (ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовара), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовараИзПапки), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовара), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовараИзПапки))
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.РесурсПланирования = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования
			|ИЗ
			|	Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоВидамПланирования КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования
			|ГДЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования В (ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхРаботПоВидамРемонта), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхРаботПоВидамРемонта))
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.РесурсПланирования = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования
			|ИЗ
			|	Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоВидамПланирования КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования
			|ГДЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования В (ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовара), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхАвторабот), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовараИзПапки), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхАвторабот), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхТоваров), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоОборотуЗаПериодПоАвтоработам), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоОборотуЗаПериодПоТоварам), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхРаботПоВидамРемонта), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхРаботПоВидамРемонта))
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.Ссылка = &Ссылка
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.СуммаРесурса = 0
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования
			|ИЗ
			|	Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоВидамПланирования КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования
			|ГДЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования В (ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовара), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданныхАвторабот), ЗНАЧЕНИЕ(Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовараИзПапки))
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.Ссылка = &Ссылка
			|	И Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.КоличествоРесурса = 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.ВидПланирования
			|ПОМЕСТИТЬ ТаблицаНезаполненныхБонусовМалусов
			|ИЗ
			|	Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоБонусамМалусам КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоВидамПланирования КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования
			|		ПО Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.ВидПланирования = Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования
			|			И (Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.Ссылка = &Ссылка)
			|			И (Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.Ссылка = &Ссылка)
			|ГДЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.ВидБонуса = ЗНАЧЕНИЕ(Перечисление.Renault_ВидыБонусовМалусовПланаПродажАвтосервиса.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.ВидПланирования
			|ИЗ
			|	Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоБонусамМалусам КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Renault_НастрокиПланаПродажАвтосервиса.ДанныеПоВидамПланирования КАК Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования
			|		ПО Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.ВидПланирования = Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.ВидПланирования
			|			И (Renault_НастрокиПланаПродажАвтосервисаДанныеПоВидамПланирования.Ссылка = &Ссылка)
			|			И (Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.Ссылка = &Ссылка)
			|ГДЕ
			|	Renault_НастрокиПланаПродажАвтосервисаДанныеПоБонусамМалусам.ВидМалуса = ЗНАЧЕНИЕ(Перечисление.Renault_ВидыБонусовМалусовПланаПродажАвтосервиса.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПРЕДСТАВЛЕНИЕ(ТаблицаНезаполненныхДанных.ВидПланирования)
			|ИЗ
			|	ТаблицаНезаполненныхДанных КАК ТаблицаНезаполненныхДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПРЕДСТАВЛЕНИЕ(ТаблицаНезаполненныхБонусовМалусов.ВидПланирования)
			|ИЗ
			|	ТаблицаНезаполненныхБонусовМалусов КАК ТаблицаНезаполненныхБонусовМалусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЕСТЬNULL(ТаблицаНезаполненныхБонусовМалусов.ВидПланирования, ТаблицаНезаполненныхДанных.ВидПланирования) КАК ВидПланирования
			|ИЗ
			|	ТаблицаНезаполненныхДанных КАК ТаблицаНезаполненныхДанных
			|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаНезаполненныхБонусовМалусов КАК ТаблицаНезаполненныхБонусовМалусов
			|		ПО ТаблицаНезаполненныхДанных.ВидПланирования = ТаблицаНезаполненныхБонусовМалусов.ВидПланирования";
		Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);	
		Результат = Запрос.ВыполнитьПакет();
		
		Если НЕ Результат[2].Пустой() Тогда
			Выборка = Результат[2].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ВидПланированияПредставление = Выборка.ВидПланированияПредставление;
				
				Сообщить("Для настроек вида планирования - """ + ВидПланированияПредставление + """, заполнены не все обязательные поля!");
			КонецЦикла;
			
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ Результат[3].Пустой() Тогда
			Выборка = Результат[3].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ВидПланированияПредставление = Выборка.ВидПланированияПредставление;
				
				Сообщить("Для вида планирования - """ + ВидПланированияПредставление + """, не заполнены поля вид бонуса или/и вид малуса!");
			КонецЦикла;
			
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ Результат[4].Пустой() Тогда
			Выборка = Результат[4].Выбрать();
			
			СписокВидовПланирования = Новый СписокЗначений();
			
			Пока Выборка.Следующий() Цикл
				СписокВидовПланирования.Добавить(Выборка.ВидПланирования);
			КонецЦикла;
			
			Оформление(ЦветФонаСтрокиСОшибками, СписокВидовПланирования);
			
			Оформить = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВидамПланированияБуферПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ ЗначениеЗаполнено(ТекущийВидПланирования) Тогда
		Отказ = Истина;
	Иначе
		Если ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхАвторабот") 
			ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхТоваров") 
			ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоОборотуЗаПериодПоАвтоработам") 
			ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоОборотуЗаПериодПоТоварам") Тогда
			
			Если ДанныеПоВидамПланированияБуфер.Количество() > 0 Тогда
				Сообщить("Для выбранного вида планирования предусмотрена только одна строка!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВидамПланированияБуферПослеУдаления(Элемент)
	
	Если ЗначениеЗаполнено(ТекущийВидПланирования) Тогда
		Если ДанныеПоВидамПланированияБуфер.Количество() = 0 Тогда
			ТабДанныеПоВидамПланирования = Объект.ДанныеПоВидамПланирования;
			Отбор = Новый Структура("ВидПланирования", ТекущийВидПланирования);
			Строки = ТабДанныеПоВидамПланирования.НайтиСтроки(Отбор);
			Для Каждого Строка Из Строки Цикл
				Индекс = ТабДанныеПоВидамПланирования.Индекс(Строка);
				ТабДанныеПоВидамПланирования.Удалить(Индекс);
			КонецЦикла;
		КонецЕсли;
		ОформитьСтроки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВидамПланированияБуферПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если ЗначениеЗаполнено(ТекущийВидПланирования) И НоваяСтрока Тогда
		Строка = Элементы.ДанныеПоВидамПланированияБуфер.ТекущиеДанные;
		Строка.ВидПланирования = ТекущийВидПланирования;
		ОформитьСтроки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВидамПланированияБуферПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "ДанныеПоВидамПланированияБуферРесурсПланирования" Тогда
		МассивТипов = Новый Массив;
		
		Если ЗначениеЗаполнено(ТекущийВидПланирования) Тогда
			МассивТипов = Новый Массив;
			
			Если ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданныхАвторабот")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхАвторабот") Тогда
				
				МассивТипов.Добавить(Тип("СправочникСсылка.Автоработы"));
			ИначеЕсли ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовара")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовара") 
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовараИзПапки")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовараИзПапки") Тогда 
				
				МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
			ИначеЕсли ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхРаботПоВидамРемонта")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхРаботПоВидамРемонта") Тогда 
				
				МассивТипов.Добавить(Тип("СправочникСсылка.ВидыРемонта"));
			КонецЕсли; 
			
			ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
			Элемент.ПодчиненныеЭлементы.ДанныеПоВидамПланированияБуферРесурсПланирования.ОграничениеТипа = ОписаниеТипов;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВидамПланированияБуферРесурсПланированияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекущийВидПланирования) Тогда
		ВыбранноеЗначение = Элементы.ДанныеПоВидамПланированияБуфер.ТекущиеДанные.РесурсПланирования;
		
		Если ЭтоГруппа(ВыбранноеЗначение) Тогда
			Если ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданныхАвторабот")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхАвторабот") Тогда
				
				Сообщить("Выберите автоработу, а не папку!");
				Элементы.ДанныеПоВидамПланированияБуфер.ТекущиеДанные.РесурсПланирования = ПредопределенноеЗначение("Справочник.Автоработы.ПустаяСсылка");
			ИначеЕсли ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовара")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовара") Тогда
				
				Сообщить("Выберите товар, а не папку!");
				Элементы.ДанныеПоВидамПланированияБуфер.ТекущиеДанные.РесурсПланирования = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			КонецЕсли;
		Иначе
			Если ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовараИзПапки")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовараИзПапки") Тогда 
				
				Сообщить("Выберите папку с товарами, а не товар!");
				Элементы.ДанныеПоВидамПланированияБуфер.ТекущиеДанные.РесурсПланирования = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоБонусамМалусамПриАктивизацииСтроки(Элемент)
	
	ТекущийВидПланирования = ТекущийВидПланирования();
	
	Если ЗначениеЗаполнено(ТекущийВидПланирования) Тогда
		Если ДанныеПоВидамПланированияБуфер.Количество() <> 0 Тогда
			ПерезаполнитьДанныеПоВидамПланированияИзБуфера();
		КонецЕсли;
		ДанныеПоВидамПланированияБуфер.Очистить();
		Отбор = Новый Структура("ВидПланирования", ТекущийВидПланирования);
		Строки = Объект.ДанныеПоВидамПланирования.НайтиСтроки(Отбор);
		Для Каждого Строка Из Строки Цикл
			Стр = ДанныеПоВидамПланированияБуфер.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Строка);
		КонецЦикла;
		УстановитьИнтерфейсФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоБонусамМалусамПриИзменении(Элемент)
	
	ОформитьСтроки();
	
КонецПроцедуры
/////////////////////////////////////////////////////////////Разные процедуры и функции/////////////////////////////////////////////
&НаКлиенте
Процедура ПерезаполнитьДанныеПоВидамПланированияИзБуфера()
	
	ВидПланирования = ДанныеПоВидамПланированияБуфер[0].ВидПланирования;
	
	ТабДанныеПоВидамПланирования = Объект.ДанныеПоВидамПланирования;
	
	Отбор = Новый Структура("ВидПланирования", ВидПланирования);
	Строки = ТабДанныеПоВидамПланирования.НайтиСтроки(Отбор);
	
	Для Каждого Строка Из Строки Цикл
		Индекс = ТабДанныеПоВидамПланирования.Индекс(Строка);
		ТабДанныеПоВидамПланирования.Удалить(Индекс);
	КонецЦикла;
	
	Для Каждого Строка Из ДанныеПоВидамПланированияБуфер Цикл
		Стр = ТабДанныеПоВидамПланирования.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Строка);
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ТекущийВидПланирования()
	
	ТекущиеДанныеПоБонусамМалусам = Элементы.ДанныеПоБонусамМалусам.ТекущиеДанные;
	
	Если ТекущиеДанныеПоБонусамМалусам = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ТекущиеДанныеПоБонусамМалусам.ВидПланирования;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоГруппа(СсылкаНаОбъект)
	
	Возврат СсылкаНаОбъект.ЭтоГруппа;
	
КонецФункции

&НаКлиенте
Процедура УстановитьИнтерфейсФормы()
	
	НастраиваемыеЭлементы = Новый Структура("РесурсПланирования, СуммаРесурса, КоличествоРесурса");
	
	Для Каждого ЭлементНастройки Из НастраиваемыеЭлементы Цикл
		Ключ = ЭлементНастройки.Ключ;
		
		Если Ключ = "РесурсПланирования" Тогда
			ЗаголовокКолонки = "Товар";
			ВидимостьКолонки  = Истина;
			
			Если ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданныхАвторабот")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхАвторабот") Тогда
				
				ЗаголовокКолонки = "Авторабота";
			ИначеЕсли ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовара")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовара") Тогда
				
				ЗаголовокКолонки = "Товар";
			ИначеЕсли ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовараИзПапки") 
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданногоТовараИзПапки") Тогда
				
				ЗаголовокКолонки = "Папка товаров";
			ИначеЕсли ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеПроданныхРаботПоВидамРемонта")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхРаботПоВидамРемонта") Тогда
				
				ЗаголовокКолонки = "Вид ремонта"
			ИначеЕсли ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхАвторабот") 
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоСуммеСреднегоЧекаПроданныхТоваров") 
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоОборотуЗаПериодПоАвтоработам") 
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоОборотуЗаПериодПоТоварам") Тогда
				
				ВидимостьКолонки = Ложь;
			КонецЕсли;
		ИначеЕсли Ключ = "СуммаРесурса" Тогда
			ЗаголовокКолонки = "Сумма";
			ВидимостьКолонки  = Истина;
			
			Если ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданныхАвторабот") 
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовара")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовараИзПапки") Тогда
				
				ВидимостьКолонки  = Ложь;	
			КонецЕсли;
		ИначеЕсли Ключ = "КоличествоРесурса" Тогда
			ЗаголовокКолонки = "Количество";
			ВидимостьКолонки  = Ложь;
			
			Если ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданныхАвторабот") 
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовара")
				ИЛИ ТекущийВидПланирования = ПредопределенноеЗначение("Справочник.Renault_ВидыПланированияПланаПродажАвтосервиса.ПоКоличествуПроданногоТовараИзПапки")Тогда
				
				ВидимостьКолонки  = Истина;
			КонецЕсли;
		КонецЕсли;
		
		НастройкаЭлемента = Новый Структура("Заголовок, АвтоОтметкаНезаполненного, Видимость", ЗаголовокКолонки, ВидимостьКолонки, ВидимостьКолонки);
		НастраиваемыеЭлементы.Вставить(Ключ, НастройкаЭлемента);
	КонецЦикла;
	
	Для Каждого ЭлементНастройки Из НастраиваемыеЭлементы Цикл
		ЗаполнитьЗначенияСвойств(Элементы["ДанныеПоВидамПланированияБуфер" + ЭлементНастройки.Ключ], ЭлементНастройки.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьСтроки()
	
	Если ДанныеПоВидамПланированияБуфер.Количество() = 0 Тогда 
		ЦветФона = ЦветФонаСтандартный;
	ИначеЕсли ДанныеПоВидамПланированияБуфер.Количество() = 1 ИЛИ Оформить Тогда
		ЦветФона = ЦветФонаСтрокиСДанными;
	Иначе
		Возврат;
	КонецЕсли;
	
	Оформление(ЦветФона, ТекущийВидПланирования);
	
КонецПроцедуры

&НаСервере
Процедура Оформление(ЦветФонаСтроки, ВидПланирования)
	
	НачальнаяТочкаОформления = "ВидПланирования";
	
	ИмяТабЧасти = "ДанныеПоБонусамМалусам";
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	
	ОформлениеУО = ЭлементУсловногоОформления.Оформление;
	ОтборУО = ЭлементУсловногоОформления.Отбор;
	ОформляемыеПоляУО = ЭлементУсловногоОформления.Поля;
	
	ОформлениеУО.УстановитьЗначениеПараметра("ЦветФона", ЦветФонаСтроки);
	
	ЭлементОтбора                = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект." + ИмяТабЧасти + "." + НачальнаяТочкаОформления);
	
	Если ТипЗнч(ВидПланирования) = Тип("СправочникСсылка.Renault_ВидыПланированияПланаПродажАвтосервиса") Тогда
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	КонецЕсли;
	
	ЭлементОтбора.ПравоеЗначение = ВидПланирования;
	ЭлементОтбора.Использование  = Истина;
	
	Для каждого РеквизитТЧ Из Метаданные["Справочники"]["Renault_НастрокиПланаПродажАвтосервиса"].ТабличныеЧасти[ИмяТабЧасти].Реквизиты Цикл
		НазваниеРеквизита = РеквизитТЧ.Имя;
		ОформляемоеПоле = ОформляемыеПоляУО.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТабЧасти + НазваниеРеквизита);
	КонецЦикла;
	
	ОформляемоеПоле = ОформляемыеПоляУО.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТабЧасти + "НомерСтроки");
	
КонецПроцедуры
